{
  "format": "layers-model",
  "generatedBy": "keras v2.15.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "2.15.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "model_2",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 16],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "angles_input"
            },
            "name": "angles_input",
            "inbound_nodes": []
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 12, 3],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "points_input"
            },
            "name": "points_input",
            "inbound_nodes": []
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_10",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_10",
            "inbound_nodes": [[["angles_input", 0, 0, {}]]]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_4",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [5],
              "strides": [1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_4",
            "inbound_nodes": [[["points_input", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_10",
              "trainable": true,
              "dtype": "float32",
              "axis": [1],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_10",
            "inbound_nodes": [[["dense_10", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_12",
              "trainable": true,
              "dtype": "float32",
              "axis": [2],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_12",
            "inbound_nodes": [[["conv1d_4", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_10",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.3,
              "noise_shape": null,
              "seed": null
            },
            "name": "dropout_10",
            "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_5",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3],
              "strides": [1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_5",
            "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_11",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_11",
            "inbound_nodes": [[["dropout_10", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_13",
              "trainable": true,
              "dtype": "float32",
              "axis": [2],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_13",
            "inbound_nodes": [[["conv1d_5", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_11",
              "trainable": true,
              "dtype": "float32",
              "axis": [1],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_11",
            "inbound_nodes": [[["dense_11", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_12",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.3,
              "noise_shape": null,
              "seed": null
            },
            "name": "dropout_12",
            "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_11",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.3,
              "noise_shape": null,
              "seed": null
            },
            "name": "dropout_11",
            "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]
          },
          {
            "class_name": "GlobalAveragePooling1D",
            "config": {
              "name": "global_average_pooling1d_2",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last",
              "keepdims": false
            },
            "name": "global_average_pooling1d_2",
            "inbound_nodes": [[["dropout_12", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate_2",
              "trainable": true,
              "dtype": "float32",
              "axis": -1
            },
            "name": "concatenate_2",
            "inbound_nodes": [
              [
                ["dropout_11", 0, 0, {}],
                ["global_average_pooling1d_2", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_12",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_12",
            "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_14",
              "trainable": true,
              "dtype": "float32",
              "axis": [1],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_14",
            "inbound_nodes": [[["dense_12", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_13",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.4,
              "noise_shape": null,
              "seed": null
            },
            "name": "dropout_13",
            "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_13",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_13",
            "inbound_nodes": [[["dropout_13", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_14",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.3,
              "noise_shape": null,
              "seed": null
            },
            "name": "dropout_14",
            "inbound_nodes": [[["dense_13", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_14",
              "trainable": true,
              "dtype": "float32",
              "units": 2,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_14",
            "inbound_nodes": [[["dropout_14", 0, 0, {}]]]
          }
        ],
        "input_layers": [
          ["angles_input", 0, 0],
          ["points_input", 0, 0]
        ],
        "output_layers": [["dense_14", 0, 0]]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "batch_normalization_10/gamma",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_10/beta",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_10/moving_mean",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_10/moving_variance",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_11/gamma",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_11/beta",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_11/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_11/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_12/gamma",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_12/beta",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_12/moving_mean",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_12/moving_variance",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_13/gamma",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_13/beta",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_13/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_13/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_14/gamma",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_14/beta",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_14/moving_mean",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_14/moving_variance",
          "shape": [128],
          "dtype": "float32"
        },
        { "name": "conv1d_4/kernel", "shape": [5, 3, 128], "dtype": "float32" },
        { "name": "conv1d_4/bias", "shape": [128], "dtype": "float32" },
        {
          "name": "conv1d_5/kernel",
          "shape": [3, 128, 64],
          "dtype": "float32"
        },
        { "name": "conv1d_5/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense_10/kernel", "shape": [16, 128], "dtype": "float32" },
        { "name": "dense_10/bias", "shape": [128], "dtype": "float32" },
        { "name": "dense_11/kernel", "shape": [128, 64], "dtype": "float32" },
        { "name": "dense_11/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense_12/kernel", "shape": [128, 128], "dtype": "float32" },
        { "name": "dense_12/bias", "shape": [128], "dtype": "float32" },
        { "name": "dense_13/kernel", "shape": [128, 64], "dtype": "float32" },
        { "name": "dense_13/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense_14/kernel", "shape": [64, 2], "dtype": "float32" },
        { "name": "dense_14/bias", "shape": [2], "dtype": "float32" }
      ]
    }
  ]
}
